Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་གྱི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: When he came to him, he bowed his head to the feet of Viśvāmitra, the teacher of children; circumambulated Viśvāmitra, the teacher of children, many hundreds of thousands of times, keeping him to his right; and then stood before Viśvāmitra, the teacher of children, with his palms together in homage and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ། འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན།
en: Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ།
en: Ārya, I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་གྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པ་ཞེས་བྱ་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལས་ཡི་གེའི་ཤེས་པ་སློབ་སློབ་པ་ཡིན་གྱིས་འདིའི་གན་དུ་སོང་སྟེ་དྲིས་དང་།
en: When he had said that, Viśvāmitra, the teacher of children, said to Sudhana, the head merchant’s son, “Noble one, Śilpābhijña, a head merchant’s son here, has studied the knowledge of words from bodhisattvas.

source: འདི་ནི་ཁྱོད་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བྱ་བ་སྟོན་པར་འགྱུར་རོ་ཞེས་ནས།
en: You should go to him and ask him, and he will teach you how bodhisattvas should train in bodhisattva conduct and how they should practice it.”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས། ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པ་གང་ན་བ་དེར་སོང་སྟེ།
en: Śilpābhijña Chapter 47 Sudhana went to where Śilpābhijña, the head merchant’s son, was present.

source: ཕྱིན་ནས་ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པའི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: When he came to him, he bowed his head to the feet of Śilpābhijña, the head merchant’s son, then stood before Śilpābhijña, the head merchant’s son, with his palms together in homage and said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན།
en: Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: དེས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བཟོ་མངོན་པར་ཤེས་པ་དང་ལྡན་པ་ཐོབ་པ་སྟེ།
en: When he had said that, Śilpābhijña, the head merchant’s son, said, “Noble one, I have attained the bodhisattva liberation called higher knowledge of the arts.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ཡི་གེའི་མ་མོ་སློབ་པའི་ཚེ་ཡི་གེ་ཨ་བརྗོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མཐུས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཡུལ་ཐ་མི་དད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Noble one, in that way, while studying the alphabet, through reciting the letter A and through the power of a bodhisattva, I realized the gateway to the perfection of wisdom called the undifferentiated range.

source: ར་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་གཞིའི་བྱེ་བྲག་མཐའ་ཡས་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ra I realized the gateway to the perfection of wisdom called the infinite particulars of the bases.

source: པ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་ཡང་དག་པར་འདྲེན་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Pa I realized the gateway to the perfection of wisdom called blendingthe basis of the realm of phenomena.

source: ཙ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འཁོར་ལོ་རྣམ་པར་ཕྱེ་བ་ཀུན་ནས་གཅོད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །ན་ཞེས་བྱ་བ་བརྗོད་པ་དང་།
en: “Through reciting the letter Ca I realized the gateway to the perfection of wisdom called dividing the wheel.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་གནས་མྱེད་པས་གཞི་ཐུག་པ་མེད་པ་ཞེས་བྱ་བ་ཁོང་ད་ཆུད་དོ། །ལ་ཞེས་བྱ་བ་བརྗོད་པ་དང་།
en: “Through reciting the letter Na I realized the gateway to the perfection of wisdom called without location and without basis.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མྱིང་དང་བྲལ་ཏེ། གནས་མྱེད་པས་དྲི་མ་མྱེད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter La I realized the gateway to the perfection of wisdom called stainless through having no name and no location.

source: ད་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སྦྱོར་བ་ཕྱིར་མྱི་ལྡོག་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Da I realized the gateway to the perfection of wisdom called irreversible union.

source: བ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ba I realized the gateway to the perfection of wisdom called the vajra field.

source: ཌ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཀུན་ཏུ་འཁོར་བ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ḍa I realized the gateway to the perfection of wisdom called the complete wheel.

source: ཥ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ṣa I realized the gateway to the perfection of wisdom called the essence of the ocean.

source: བ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཀུན་ནས་རྣམ་པར་འཕེལ་བར་རྣམ་པར་བསྒྲུབ་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: Through reciting the letter Va I realized the gateway to the perfection of wisdom called the accomplishment of complete increase.

source: ཏ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སྐར་མའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ta I realized the gateway to the perfection of wisdom called the field of stars.

source: ཡ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཕུང་པོ་ཐ་མི་དད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ya I realized the gateway to the perfection of wisdom called the undifferentiatedheap.

source: ཥྚ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་གདུང་བ་ཀུན་ནས་ཞི་བར་བྱེད་པའི་འོད་ཅེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ṣṭa I realized the gateway to the perfection of wisdom called the cessation of all torment.

source: ཀ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སྤྲིན་ཐ་མྱི་དད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ka I realized the gateway to the perfection of wisdom called undifferentiated clouds.

source: ས་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆར་མངོན་པར་འབབ་པས་ཁྱབ་པར་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Sa I realized the gateway to the perfection of wisdom called the pervading rainfall.

source: མ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཤུགས་ཆེན་པོས་བརྒྱན་པའི་རྩེ་མོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ma I realized the gateway to the perfection of wisdom called the pinnacle adorned by great power.

source: ག་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཀུན་ནས་རྣམ་པར་བསྒྲུབ་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ga I realized the gateway to the perfection of wisdom called complete accomplishment.

source: ཐ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་དེ་བཞིན་ཉིད་ཐ་མྱི་དད་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Tha I realized the gateway to the perfection of wisdom called the undifferentiated essence of the true nature.

source: ཛ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འགྲོ་བའི་འཁོར་བ་རྣམ་པར་དག་པ་ལ་འཇུག་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ja I realized the gateway to the perfection of wisdom called entering the purification of the saṃsāra of beings.

source: སྭ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སངས་རྒྱས་ཐམས་ཅད་དྲན་པས་བརྒྱན་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Sva I realized the gateway to the perfection of wisdom called the display of the memory of all the buddhas.

source: དྷ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དཔྱོད་པ་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Dha I realized the gateway to the perfection of wisdom called the analysis through examination of the field of phenomena.

source: ཤ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གདམས་ངག་གི་འཁོར་ལོ་སྣང་བ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Śa I realized the gateway to the perfection of wisdom called the light of the wheel of instruction of all the buddhas.

source: ཁ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མངོན་པར་འདུ་བྱ་བའི་རྒྱུ་དང་སའི་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Kha I realized the gateway to the perfection of wisdom called the essence of the knowledge of the causes and levels of the composite.

source: ཀྴ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ལས་ཞི་བ་རྒྱ་མཚོའི་མཛོད་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Kṣa I realized the gateway to the perfection of wisdom called examining the treasure of the ocean of the pacification of karma.

source: སྟ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཉོན་མོངས་པ་ཐམས་ཅད་རྣམ་པར་འཐོར་བས་རྣམ་པར་དག་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Sta I realized the gateway to the perfection of wisdom called the essenceof purity through dispelling all kleśas.

source: ཉ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འཇིག་རྟེན་འབྱུང་བ་རྣམ་པར་དམྱིགས་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ña I realized the gateway to the perfection of wisdom called perceiving the origin of the world.

source: ཕ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འཁོར་བ་དང་མྱི་མཐུན་པའི་འཁོར་ལོའི་ཡེ་ཤེས་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Pha I realized the gateway to the perfection of wisdom called the field of the knowledge of the wheel that counters saṃsāra.

source: བྷ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་གནས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་དམྱིགས་པར་བརྒྱན་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Bha I realized the gateway to the perfection of wisdom called the display of the perception of the entire field of dwellings.

source: ཚ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་བསྩགས་པ་དམ་པའི་ཐབས་ཀྱི་སྤྱོད་པའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་ཐ་དད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Cha I realized the gateway to the perfection of wisdom called the different fields of the parasols that engage in the methodsfor supreme accumulation.

source: ཡྨ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སངས་རྒྱས་ཐམས་ཅད་བལྟ་བའི་ཕྱོགས་ལ་མངོན་དུ་གྱུར་བ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Sma I realized the gateway to the perfection of wisdom called turning in the direction of the vision of all buddhas.

source: ཧྭ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དོག་ལ་རྣམ་པར་ལྟ་བའི་སྟོབས་ཤིན་ཏུ་སྐྱེས་པ་རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Hva I realized the gateway to the perfection of wisdom called the essence of the oceanthat gives rise to the power to see the appearances of all beings.

source: ཡས་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཡོན་ཏན་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་ནན་ཏན་རྟོགས་པར་འཇུག་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Tsa I realized the gateway to the perfection of wisdom called entering the realization of the practice of the ocean of all qualities.

source: གྷ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཐམས་ཅད་ཀྱི་སྤྲིན་ཡོངས་སུ་འཛིན་པའི་རྒྱ་མཚོ་བརྟན་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Gha I realized the gateway to the perfection of wisdom called the unwavering ocean of holding the clouds of all the Dharma.

source: ཊ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་ཕྱོགས་སུ་མངོན་པར་འགྲོ་བ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ṭa I realized the gateway to the perfection of wisdom called going in the direction of the prayers of all the buddhas.

source: ན་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཡི་གེ་འཁོར་ལོ་མྱི་ཟད་པའི་མཐའ་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ṇa I realized the gateway to the perfection of wisdom called analyzing the end of the inexhaustible wheel of letters.

source: སྤ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་མཐར་ཕྱིན་པའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Spha I realized the gateway to the perfection of wisdom called the field of fully accomplishing the ripening of all beings.

source: སྐ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སའི་སྙིང་པོ་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོགས་པ་མྱེད་པར་སྣང་བས་འཁོར་ལོ་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ska I realized the gateway to the perfection of wisdom called the pervasion of the wheel through the light of the unimpeded discernment of the essences of the bhūmis.

source: སྨ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཤིན་ཏུ་བསྟན་པའི་ཡུལ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ysa I realized the gateway to the perfection of wisdom called the range of the perception of the Dharma teaching of all the buddhas.

source: ཤྩ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སེམས་ཅན་གྱི་ནམ་མཁའ་ལས་ཆོས་ཀྱི་སྤྲིན་གྱི་འབྲུག་སྒྲ་བྱུང་བས་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Śca I realized the gateway to the perfection of wisdom called the pervasion of the thunder that comes from the clouds of Dharma in the sky of beings.

source: ཋ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་སེམས་ཅན་གྱི་དོན་བདག་མྱེད་པའི་དགོས་པ་མཐར་ཕྱིན་པར་ཟིན་པའི་སྒྲོན་མ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ṭha I realized the gateway to the perfection of wisdom called the lamp that possesses the complete accomplishment of the necessity of the absence of a self for the sake of beings.

source: དྷ་ཞེས་བྱ་བ་བརྗོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཀྱི་འཁོར་ལོ་ཐ་མི་དད་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ཁོང་དུ་ཆུད་དོ། །
en: “Through reciting the letter Ḍha I realized the gateway to the perfection of wisdom called the undifferentiated essence of the wheel of the Dharma.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་དེ་ལྟར་ཡི་གེའི་མ་མོ་སློབ་པའི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་དེ་དག་ལ་སྩོགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཚད་མེད་གྲངས་མེད་པ་ཞིག་ཁོང་དུ་ཆུད་དེ།
en: “Noble one, I have realized those entrances to the perfection of wisdom and so on, countless innumerable entrances to the perfection of wisdom.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བཟོ་མངོན་པར་ཤེས་པ་དང་ལྡན་པ་འདི་ཐོབ་པ་སྟེ། རིགས་ཀྱི་བུ་ཁོ་བོས་དེ་ཤེས་པར་ཟད་ན།
en: “Noble one, in that way, I have attained the bodhisattva liberation called higher knowledge of the arts.

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའི་འཇིག་རྟེན་དང་། འཇིག་རྟེན་ལས་འདས་པའི་བཟོའི་གནས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་མཆོག་ཐོབ་པ། བཟོའི་གནས་ཐམས་ཅད་ལ་འཇུག་པ་དང་། ཡི་གེ་དང་གྲངས་དང་རྩིས་དང་ཤོད་ཐབས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། སྔགས་དང་སྨན་ཐམས་ཅད་ཀྱི་ཚུལ་ལ་མཁས་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བ་དང་། འབྱུང་པོ་དང་། གཟའ་དང་སྐར་མ་དང་། བརྗེད་བྱེད་དང་། བྱད་སྟེམས་དང་། རོ་ལངས་ཀྱི་གདོན་ཐམས་ཅད་གསོ་བ་དང་། སེམས་ཅན་གྱི་ཁམས་གསོ་བར་བྱ་བའི་སྨན་དང་ཐབས་ཀྱི་རྒྱུས་དང་ཁམས་ཀྱི་ཐབས་ཡོངས་སུ་བསྡུ་བའི་ཆོ་ག་དང་། གསེར་དང་ནོར་བུ་དང་། མུ་ཏིག་དང་བཻཌཱུརྱ་དང་། དུང་དང་མན་ཤེལ་དང་། བྱི་རུ་དང་། མུ་ཏིག་དམར་པོ་དང་།
en: “Noble one, I know only that, and therefore how could I know or describe the qualities of the bodhisattvas who have attained perfection in all mundane and supramundane arts; who engage in all arts; who comprehend all writing, numbers, counting, and calculations; who have attained skill in the ways of all mantras and medicines; who heal demonic afflictions from bhūtas, planets and stars, apasmāras, kākhordas, and vetālas; who know the medicines and methods that heal the elements of beings; who know the practices of the collected methods for the elements; who know the origin, creation, classes, sources, and values of gold, jewels, pearls, beryl, conch, crystal, coral, red pearls, white coral, saffron, rubies, emeralds, and all precious materials; who establish parks, forests for mendicants, towns, villages, regions, lands, and royal residences; who comprehend the zodiac, omens, signs on beings, earth tremors, red skies, shooting stars, good and bad signs, signs of famine and harvest, and all other mundane knowledge; and who can explain and teach and comprehend all the categories of supramundane qualities, knowing them correctly without obscuration, doubt, uncertainty, perplexity, indecision, bewilderment, stupidity, unhappiness, lack of confidence, lack of knowledge, or misunderstanding?

source: མུ་ས་ར་གལ་བ་དང་། གེ་སར་དང་། དཔལ་གྱི་སྙིང་པོ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་འབྱུང་ཞིང་སྐྱེ་བ་དང་། རིགས་དང་འབྱུང་ཁུངས་དང་། རིན་ཐང་གི་རྒྱུས་ཤེས་པར་བྱ་བ་དང་། བཟའ་ཤིང་གི་ར་བ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། གྲོང་དང་གྲོང་ཁྱེར་དང་། ལྗོངས་དང་ཁང་པ་དང་། རྒྱལ་པོའི་གནས་མངོན་པར་བསྒྲུབ་པ་དང་། རི་དགས་དང་། འཁོར་ལོ་དང་། མཚན་མ་བལྟ་བ་དང་། སེམས་ཅན་གྱི་མཚན་གྱི་ལྟས་དང་། ས་གཡོ་བ་དང་། ཕྱོགས་ཚིག་པ་དང་། སྐར་མདའ་ལྷུང་བ་དང་། དགེ་མྱི་དགེ་དང་། མུ་གེ་དང་ལོ་ལེགས་པ་ལ་སྩོགས་པ་འཇིག་རྟེན་གྱི་ཐ་མ་ལག་ཐམས་ཅད་ཀྱི་རྒྱུས་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམ་པར་ཕྱེ་བ་ཐམས་ཅད་བརྗོད་ཅིང་བསྟན་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཡང་དག་པ་ཉིད་རྗེས་སུ་རིག་པར་བྱ་བའི་རྒྱུས་ལ་སྒྲིབ་པ་འམ། ཐེ་ཙོམ་མམ། ཡིད་གཉིས་སམ། ནེམ་ནུར་རམ། ཚམ་ཚོམ་མམ། མགོ་རྨོངས་པའམ། འཁོར་བའམ། མྱི་བདེ་བའམ། སྒྱིད་ལུག་པའམ།
en: “Depart, noble one.

source: མྱི་ཤེས་པའམ། ཁོང་དུ་མི་ཆུད་པ་མྱེད་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པ་འམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ཡུལ་མ་ག་ངྷ་འདི་ཉིད་ཀྱི་ལྗོངས་དག་པ་ཞེས་བྱ་བའི་གྲོང་ཁྱེར་འཚོ་བ་ཞེས་བྱ་བ་ན་དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་ཅེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: In the town called Vartanaka in the region called Kevalaka in this land of Magadha resides a kalyāṇamitra by the name of Bhadrottamā.

source: ཇི་ལྟར་ནན་ཏན་ཏུ་བྱ་བ་དྲིས་ཤིག །
en: Go to her and ask her, ‘How should a bodhisattva train in and practice bodhisattva conduct?’ ”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of Śilpābhijña, the head merchant’s son.

source: ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ།
en: He circumambulated Śilpābhijña, the head merchant’s son, many hundreds of thousands of times, keeping him to his right, and, looking back at him again and again, he departed from Śilpābhijña, the head merchant’s son.

source: ཚོང་དཔོན་གྱི་བུ་བཟོ་མངོན་པར་ཤེས་པའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལྗོངས་དག་པའི་གྲོང་ཁྱེར་འཚོ་བ་གང་ན་བ་དང་། དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Bhadrottamā Chapter 48 Sudhana, the head merchant’s son, went to the town called Vartanaka in the region of Kevalaka and approached the kalyāṇamitra Bhadrottamā.

source: དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་གི་མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: When he approached the kalyāṇamitra Bhadrottamā, he bowed his head to her feet, and then he stood before the kalyāṇamitra Bhadrottamā with his palms together in homage and said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ། འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་འཕགས་མས་བདག་ལ་བསྟན་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་གནས་མེད་པའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་ཤེས་ཤིང་སྟོན་པ་སྟེ། ཁོ་མོས་ཐོགས་པ་མྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཀྱང་ཐོབ་པོ། །ཏིང་ངེ་འཛིན་དེ་ནི་ཆོས་གང་ལ་ཡང་ཐོགས་པ་མྱེད་དེ། དེ་ལ་གནས་ན་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་མྱིག་ཐོགས་པ་མེད་པ་ལ་འཇུག་གོ །
en: When he had said that, the kalyāṇamitra Bhadrottamā said, “Noble one, I know and teach the Dharma teaching called The Field without Location, and I have attained the samādhi called unimpeded.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་རྣ་བ་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྣ་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ལྕེ་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ལུས་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡིད་ཐོགས་པ་མྱེད་པ་ཡང་རབ་ཏུ་འཇུག་གོ །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རླབས་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྣང་བ་ཐོགས་པ་མྱེད་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཤུགས་ཐོགས་པ་མྱེད་པ་འགྲོ་བ་རབ་ཏུ་སྣང་བའི་དཀྱིལ་འཁོར་དག་ཀྱང་རབ་ཏུ་འཇུག་གོ །
en: That samādhi is unimpeded toward any phenomenon, and when I rest within it, I have the unimpeded eyes of omniscience, I have the unimpeded ears of omniscience, I have the unimpeded nose of omniscience, I have the unimpeded tongue of omniscience, I have the unimpeded body of omniscience, I have the unimpeded mind of omniscience, I have the unimpeded waves of omniscience, I have the unimpeded lightning of omniscience, and I have the unimpeded power of omniscience and the field of the illumination of beings.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་གནས་མེད་པའི་དཀྱིལ་འཁོར་འདི་ཤེས་ཤིང་ཁོང་དུ་ཆུད་པར་ཟད་ན།
en: “Noble one, I know only this Dharma teaching called The Field without Location.

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཆགས་པ་མེད་པ་ལ་རིལ་གྱིས་ཤེས་པར་ནུས་རེ་སྐན། །
en: How could I know completely unimpeded bodhisattva conduct?

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་ན་གྲོང་ཁྱེར་རྒྱས་པའི་འགྲམ་ཞེས་པ་ཡོད་དེ།
en: “Depart, noble one. In the southern region there is town called Bharukaccha.

source: དེ་ན་གསེར་འཚོང་གཅེས་པ་གཏོང་བ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: There resides a goldsmith by the name of Muktāsāra.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །
en: Go to him and ask him, ‘How should a bodhisattva train in and practice bodhisattva conduct?’ ”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the kalyāṇamitra Bhadrottamā.
